============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Kernel Shape              Param #
============================================================================================================================================
AttU_Net                                 --                        --                        --                        --
├─conv_block: 1-1                        [2, 3, 128, 128]          [2, 64, 128, 128]         --                        --
│    └─Sequential: 2-1                   [2, 3, 128, 128]          [2, 64, 128, 128]         --                        --
│    │    └─Conv2d: 3-1                  [2, 3, 128, 128]          [2, 64, 128, 128]         [3, 64, 3, 3]             1,792
│    │    └─BatchNorm2d: 3-2             [2, 64, 128, 128]         [2, 64, 128, 128]         [64]                      128
│    │    └─ReLU: 3-3                    [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
│    │    └─Conv2d: 3-4                  [2, 64, 128, 128]         [2, 64, 128, 128]         [64, 64, 3, 3]            36,928
│    │    └─BatchNorm2d: 3-5             [2, 64, 128, 128]         [2, 64, 128, 128]         [64]                      128
│    │    └─ReLU: 3-6                    [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
├─MaxPool2d: 1-2                         [2, 64, 128, 128]         [2, 64, 64, 64]           --                        --
├─conv_block: 1-3                        [2, 64, 64, 64]           [2, 128, 64, 64]          --                        --
│    └─Sequential: 2-2                   [2, 64, 64, 64]           [2, 128, 64, 64]          --                        --
│    │    └─Conv2d: 3-7                  [2, 64, 64, 64]           [2, 128, 64, 64]          [64, 128, 3, 3]           73,856
│    │    └─BatchNorm2d: 3-8             [2, 128, 64, 64]          [2, 128, 64, 64]          [128]                     256
│    │    └─ReLU: 3-9                    [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
│    │    └─Conv2d: 3-10                 [2, 128, 64, 64]          [2, 128, 64, 64]          [128, 128, 3, 3]          147,584
│    │    └─BatchNorm2d: 3-11            [2, 128, 64, 64]          [2, 128, 64, 64]          [128]                     256
│    │    └─ReLU: 3-12                   [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
├─MaxPool2d: 1-4                         [2, 128, 64, 64]          [2, 128, 32, 32]          --                        --
├─conv_block: 1-5                        [2, 128, 32, 32]          [2, 256, 32, 32]          --                        --
│    └─Sequential: 2-3                   [2, 128, 32, 32]          [2, 256, 32, 32]          --                        --
│    │    └─Conv2d: 3-13                 [2, 128, 32, 32]          [2, 256, 32, 32]          [128, 256, 3, 3]          295,168
│    │    └─BatchNorm2d: 3-14            [2, 256, 32, 32]          [2, 256, 32, 32]          [256]                     512
│    │    └─ReLU: 3-15                   [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
│    │    └─Conv2d: 3-16                 [2, 256, 32, 32]          [2, 256, 32, 32]          [256, 256, 3, 3]          590,080
│    │    └─BatchNorm2d: 3-17            [2, 256, 32, 32]          [2, 256, 32, 32]          [256]                     512
│    │    └─ReLU: 3-18                   [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
├─MaxPool2d: 1-6                         [2, 256, 32, 32]          [2, 256, 16, 16]          --                        --
├─conv_block: 1-7                        [2, 256, 16, 16]          [2, 512, 16, 16]          --                        --
│    └─Sequential: 2-4                   [2, 256, 16, 16]          [2, 512, 16, 16]          --                        --
│    │    └─Conv2d: 3-19                 [2, 256, 16, 16]          [2, 512, 16, 16]          [256, 512, 3, 3]          1,180,160
│    │    └─BatchNorm2d: 3-20            [2, 512, 16, 16]          [2, 512, 16, 16]          [512]                     1,024
│    │    └─ReLU: 3-21                   [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
│    │    └─Conv2d: 3-22                 [2, 512, 16, 16]          [2, 512, 16, 16]          [512, 512, 3, 3]          2,359,808
│    │    └─BatchNorm2d: 3-23            [2, 512, 16, 16]          [2, 512, 16, 16]          [512]                     1,024
│    │    └─ReLU: 3-24                   [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
├─MaxPool2d: 1-8                         [2, 512, 16, 16]          [2, 512, 8, 8]            --                        --
├─conv_block: 1-9                        [2, 512, 8, 8]            [2, 1024, 8, 8]           --                        --
│    └─Sequential: 2-5                   [2, 512, 8, 8]            [2, 1024, 8, 8]           --                        --
│    │    └─Conv2d: 3-25                 [2, 512, 8, 8]            [2, 1024, 8, 8]           [512, 1024, 3, 3]         4,719,616
│    │    └─BatchNorm2d: 3-26            [2, 1024, 8, 8]           [2, 1024, 8, 8]           [1024]                    2,048
│    │    └─ReLU: 3-27                   [2, 1024, 8, 8]           [2, 1024, 8, 8]           --                        --
│    │    └─Conv2d: 3-28                 [2, 1024, 8, 8]           [2, 1024, 8, 8]           [1024, 1024, 3, 3]        9,438,208
│    │    └─BatchNorm2d: 3-29            [2, 1024, 8, 8]           [2, 1024, 8, 8]           [1024]                    2,048
│    │    └─ReLU: 3-30                   [2, 1024, 8, 8]           [2, 1024, 8, 8]           --                        --
├─up_conv: 1-10                          [2, 1024, 8, 8]           [2, 512, 16, 16]          --                        --
│    └─Sequential: 2-6                   [2, 1024, 8, 8]           [2, 512, 16, 16]          --                        --
│    │    └─Upsample: 3-31               [2, 1024, 8, 8]           [2, 1024, 16, 16]         --                        --
│    │    └─Conv2d: 3-32                 [2, 1024, 16, 16]         [2, 512, 16, 16]          [1024, 512, 3, 3]         4,719,104
│    │    └─BatchNorm2d: 3-33            [2, 512, 16, 16]          [2, 512, 16, 16]          [512]                     1,024
│    │    └─ReLU: 3-34                   [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
├─Attention_block: 1-11                  --                        [2, 512, 16, 16]          --                        --
│    └─Sequential: 2-7                   [2, 512, 16, 16]          [2, 256, 16, 16]          --                        --
│    │    └─Conv2d: 3-35                 [2, 512, 16, 16]          [2, 256, 16, 16]          [512, 256, 1, 1]          131,328
│    │    └─BatchNorm2d: 3-36            [2, 256, 16, 16]          [2, 256, 16, 16]          [256]                     512
│    └─Sequential: 2-8                   [2, 512, 16, 16]          [2, 256, 16, 16]          --                        --
│    │    └─Conv2d: 3-37                 [2, 512, 16, 16]          [2, 256, 16, 16]          [512, 256, 1, 1]          131,328
│    │    └─BatchNorm2d: 3-38            [2, 256, 16, 16]          [2, 256, 16, 16]          [256]                     512
│    └─ReLU: 2-9                         [2, 256, 16, 16]          [2, 256, 16, 16]          --                        --
│    └─Sequential: 2-10                  [2, 256, 16, 16]          [2, 1, 16, 16]            --                        --
│    │    └─Conv2d: 3-39                 [2, 256, 16, 16]          [2, 1, 16, 16]            [256, 1, 1, 1]            257
│    │    └─BatchNorm2d: 3-40            [2, 1, 16, 16]            [2, 1, 16, 16]            [1]                       2
├─conv_block: 1-12                       [2, 1024, 16, 16]         [2, 512, 16, 16]          --                        --
│    └─Sequential: 2-11                  [2, 1024, 16, 16]         [2, 512, 16, 16]          --                        --
│    │    └─Conv2d: 3-41                 [2, 1024, 16, 16]         [2, 512, 16, 16]          [1024, 512, 3, 3]         4,719,104
│    │    └─BatchNorm2d: 3-42            [2, 512, 16, 16]          [2, 512, 16, 16]          [512]                     1,024
│    │    └─ReLU: 3-43                   [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
│    │    └─Conv2d: 3-44                 [2, 512, 16, 16]          [2, 512, 16, 16]          [512, 512, 3, 3]          2,359,808
│    │    └─BatchNorm2d: 3-45            [2, 512, 16, 16]          [2, 512, 16, 16]          [512]                     1,024
│    │    └─ReLU: 3-46                   [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
├─up_conv: 1-13                          [2, 512, 16, 16]          [2, 256, 32, 32]          --                        --
│    └─Sequential: 2-12                  [2, 512, 16, 16]          [2, 256, 32, 32]          --                        --
│    │    └─Upsample: 3-47               [2, 512, 16, 16]          [2, 512, 32, 32]          --                        --
│    │    └─Conv2d: 3-48                 [2, 512, 32, 32]          [2, 256, 32, 32]          [512, 256, 3, 3]          1,179,904
│    │    └─BatchNorm2d: 3-49            [2, 256, 32, 32]          [2, 256, 32, 32]          [256]                     512
│    │    └─ReLU: 3-50                   [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
├─Attention_block: 1-14                  --                        [2, 256, 32, 32]          --                        --
│    └─Sequential: 2-13                  [2, 256, 32, 32]          [2, 128, 32, 32]          --                        --
│    │    └─Conv2d: 3-51                 [2, 256, 32, 32]          [2, 128, 32, 32]          [256, 128, 1, 1]          32,896
│    │    └─BatchNorm2d: 3-52            [2, 128, 32, 32]          [2, 128, 32, 32]          [128]                     256
│    └─Sequential: 2-14                  [2, 256, 32, 32]          [2, 128, 32, 32]          --                        --
│    │    └─Conv2d: 3-53                 [2, 256, 32, 32]          [2, 128, 32, 32]          [256, 128, 1, 1]          32,896
│    │    └─BatchNorm2d: 3-54            [2, 128, 32, 32]          [2, 128, 32, 32]          [128]                     256
│    └─ReLU: 2-15                        [2, 128, 32, 32]          [2, 128, 32, 32]          --                        --
│    └─Sequential: 2-16                  [2, 128, 32, 32]          [2, 1, 32, 32]            --                        --
│    │    └─Conv2d: 3-55                 [2, 128, 32, 32]          [2, 1, 32, 32]            [128, 1, 1, 1]            129
│    │    └─BatchNorm2d: 3-56            [2, 1, 32, 32]            [2, 1, 32, 32]            [1]                       2
├─conv_block: 1-15                       [2, 512, 32, 32]          [2, 256, 32, 32]          --                        --
│    └─Sequential: 2-17                  [2, 512, 32, 32]          [2, 256, 32, 32]          --                        --
│    │    └─Conv2d: 3-57                 [2, 512, 32, 32]          [2, 256, 32, 32]          [512, 256, 3, 3]          1,179,904
│    │    └─BatchNorm2d: 3-58            [2, 256, 32, 32]          [2, 256, 32, 32]          [256]                     512
│    │    └─ReLU: 3-59                   [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
│    │    └─Conv2d: 3-60                 [2, 256, 32, 32]          [2, 256, 32, 32]          [256, 256, 3, 3]          590,080
│    │    └─BatchNorm2d: 3-61            [2, 256, 32, 32]          [2, 256, 32, 32]          [256]                     512
│    │    └─ReLU: 3-62                   [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
├─up_conv: 1-16                          [2, 256, 32, 32]          [2, 128, 64, 64]          --                        --
│    └─Sequential: 2-18                  [2, 256, 32, 32]          [2, 128, 64, 64]          --                        --
│    │    └─Upsample: 3-63               [2, 256, 32, 32]          [2, 256, 64, 64]          --                        --
│    │    └─Conv2d: 3-64                 [2, 256, 64, 64]          [2, 128, 64, 64]          [256, 128, 3, 3]          295,040
│    │    └─BatchNorm2d: 3-65            [2, 128, 64, 64]          [2, 128, 64, 64]          [128]                     256
│    │    └─ReLU: 3-66                   [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
├─Attention_block: 1-17                  --                        [2, 128, 64, 64]          --                        --
│    └─Sequential: 2-19                  [2, 128, 64, 64]          [2, 64, 64, 64]           --                        --
│    │    └─Conv2d: 3-67                 [2, 128, 64, 64]          [2, 64, 64, 64]           [128, 64, 1, 1]           8,256
│    │    └─BatchNorm2d: 3-68            [2, 64, 64, 64]           [2, 64, 64, 64]           [64]                      128
│    └─Sequential: 2-20                  [2, 128, 64, 64]          [2, 64, 64, 64]           --                        --
│    │    └─Conv2d: 3-69                 [2, 128, 64, 64]          [2, 64, 64, 64]           [128, 64, 1, 1]           8,256
│    │    └─BatchNorm2d: 3-70            [2, 64, 64, 64]           [2, 64, 64, 64]           [64]                      128
│    └─ReLU: 2-21                        [2, 64, 64, 64]           [2, 64, 64, 64]           --                        --
│    └─Sequential: 2-22                  [2, 64, 64, 64]           [2, 1, 64, 64]            --                        --
│    │    └─Conv2d: 3-71                 [2, 64, 64, 64]           [2, 1, 64, 64]            [64, 1, 1, 1]             65
│    │    └─BatchNorm2d: 3-72            [2, 1, 64, 64]            [2, 1, 64, 64]            [1]                       2
├─conv_block: 1-18                       [2, 256, 64, 64]          [2, 128, 64, 64]          --                        --
│    └─Sequential: 2-23                  [2, 256, 64, 64]          [2, 128, 64, 64]          --                        --
│    │    └─Conv2d: 3-73                 [2, 256, 64, 64]          [2, 128, 64, 64]          [256, 128, 3, 3]          295,040
│    │    └─BatchNorm2d: 3-74            [2, 128, 64, 64]          [2, 128, 64, 64]          [128]                     256
│    │    └─ReLU: 3-75                   [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
│    │    └─Conv2d: 3-76                 [2, 128, 64, 64]          [2, 128, 64, 64]          [128, 128, 3, 3]          147,584
│    │    └─BatchNorm2d: 3-77            [2, 128, 64, 64]          [2, 128, 64, 64]          [128]                     256
│    │    └─ReLU: 3-78                   [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
├─up_conv: 1-19                          [2, 128, 64, 64]          [2, 64, 128, 128]         --                        --
│    └─Sequential: 2-24                  [2, 128, 64, 64]          [2, 64, 128, 128]         --                        --
│    │    └─Upsample: 3-79               [2, 128, 64, 64]          [2, 128, 128, 128]        --                        --
│    │    └─Conv2d: 3-80                 [2, 128, 128, 128]        [2, 64, 128, 128]         [128, 64, 3, 3]           73,792
│    │    └─BatchNorm2d: 3-81            [2, 64, 128, 128]         [2, 64, 128, 128]         [64]                      128
│    │    └─ReLU: 3-82                   [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
├─Attention_block: 1-20                  --                        [2, 64, 128, 128]         --                        --
│    └─Sequential: 2-25                  [2, 64, 128, 128]         [2, 32, 128, 128]         --                        --
│    │    └─Conv2d: 3-83                 [2, 64, 128, 128]         [2, 32, 128, 128]         [64, 32, 1, 1]            2,080
│    │    └─BatchNorm2d: 3-84            [2, 32, 128, 128]         [2, 32, 128, 128]         [32]                      64
│    └─Sequential: 2-26                  [2, 64, 128, 128]         [2, 32, 128, 128]         --                        --
│    │    └─Conv2d: 3-85                 [2, 64, 128, 128]         [2, 32, 128, 128]         [64, 32, 1, 1]            2,080
│    │    └─BatchNorm2d: 3-86            [2, 32, 128, 128]         [2, 32, 128, 128]         [32]                      64
│    └─ReLU: 2-27                        [2, 32, 128, 128]         [2, 32, 128, 128]         --                        --
│    └─Sequential: 2-28                  [2, 32, 128, 128]         [2, 1, 128, 128]          --                        --
│    │    └─Conv2d: 3-87                 [2, 32, 128, 128]         [2, 1, 128, 128]          [32, 1, 1, 1]             33
│    │    └─BatchNorm2d: 3-88            [2, 1, 128, 128]          [2, 1, 128, 128]          [1]                       2
├─conv_block: 1-21                       [2, 128, 128, 128]        [2, 64, 128, 128]         --                        --
│    └─Sequential: 2-29                  [2, 128, 128, 128]        [2, 64, 128, 128]         --                        --
│    │    └─Conv2d: 3-89                 [2, 128, 128, 128]        [2, 64, 128, 128]         [128, 64, 3, 3]           73,792
│    │    └─BatchNorm2d: 3-90            [2, 64, 128, 128]         [2, 64, 128, 128]         [64]                      128
│    │    └─ReLU: 3-91                   [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
│    │    └─Conv2d: 3-92                 [2, 64, 128, 128]         [2, 64, 128, 128]         [64, 64, 3, 3]            36,928
│    │    └─BatchNorm2d: 3-93            [2, 64, 128, 128]         [2, 64, 128, 128]         [64]                      128
│    │    └─ReLU: 3-94                   [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
├─Conv2d: 1-22                           [2, 64, 128, 128]         [2, 1, 128, 128]          [64, 1, 1, 1]             65
============================================================================================================================================
Total params: 34,878,573
Trainable params: 34,878,573
Non-trainable params: 0
Total mult-adds (G): 33.24
============================================================================================================================================
Input size (MB): 0.39
Forward/backward pass size (MB): 382.64
Params size (MB): 139.51
Estimated Total Size (MB): 522.55
============================================================================================================================================