============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Kernel Shape              Param #
============================================================================================================================================
UNet                                     --                        --                        --                        --
├─Sequential: 1-1                        [2, 3, 128, 128]          [2, 64, 128, 128]         --                        --
│    └─Conv2d: 2-1                       [2, 3, 128, 128]          [2, 64, 128, 128]         [3, 64, 3, 3]             1,792
│    └─ReLU: 2-2                         [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
│    └─Dropout2d: 2-3                    [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
│    └─Conv2d: 2-4                       [2, 64, 128, 128]         [2, 64, 128, 128]         [64, 64, 3, 3]            36,928
│    └─ReLU: 2-5                         [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
│    └─BatchNorm2d: 2-6                  [2, 64, 128, 128]         [2, 64, 128, 128]         [64]                      128
├─MaxPool2d: 1-2                         [2, 64, 128, 128]         [2, 64, 64, 64]           --                        --
├─Sequential: 1-3                        [2, 64, 64, 64]           [2, 128, 64, 64]          --                        --
│    └─Conv2d: 2-7                       [2, 64, 64, 64]           [2, 128, 64, 64]          [64, 128, 3, 3]           73,856
│    └─ReLU: 2-8                         [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
│    └─Dropout2d: 2-9                    [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
│    └─Conv2d: 2-10                      [2, 128, 64, 64]          [2, 128, 64, 64]          [128, 128, 3, 3]          147,584
│    └─ReLU: 2-11                        [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
│    └─BatchNorm2d: 2-12                 [2, 128, 64, 64]          [2, 128, 64, 64]          [128]                     256
├─MaxPool2d: 1-4                         [2, 128, 64, 64]          [2, 128, 32, 32]          --                        --
├─Sequential: 1-5                        [2, 128, 32, 32]          [2, 256, 32, 32]          --                        --
│    └─Conv2d: 2-13                      [2, 128, 32, 32]          [2, 256, 32, 32]          [128, 256, 3, 3]          295,168
│    └─ReLU: 2-14                        [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
│    └─Dropout2d: 2-15                   [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
│    └─Conv2d: 2-16                      [2, 256, 32, 32]          [2, 256, 32, 32]          [256, 256, 3, 3]          590,080
│    └─ReLU: 2-17                        [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
│    └─BatchNorm2d: 2-18                 [2, 256, 32, 32]          [2, 256, 32, 32]          [256]                     512
├─MaxPool2d: 1-6                         [2, 256, 32, 32]          [2, 256, 16, 16]          --                        --
├─Sequential: 1-7                        [2, 256, 16, 16]          [2, 512, 16, 16]          --                        --
│    └─Conv2d: 2-19                      [2, 256, 16, 16]          [2, 512, 16, 16]          [256, 512, 3, 3]          1,180,160
│    └─ReLU: 2-20                        [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
│    └─Dropout2d: 2-21                   [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
│    └─Conv2d: 2-22                      [2, 512, 16, 16]          [2, 512, 16, 16]          [512, 512, 3, 3]          2,359,808
│    └─ReLU: 2-23                        [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
│    └─BatchNorm2d: 2-24                 [2, 512, 16, 16]          [2, 512, 16, 16]          [512]                     1,024
├─MaxPool2d: 1-8                         [2, 512, 16, 16]          [2, 512, 8, 8]            --                        --
├─Sequential: 1-9                        [2, 512, 8, 8]            [2, 512, 16, 16]          --                        --
│    └─Conv2d: 2-25                      [2, 512, 8, 8]            [2, 1024, 8, 8]           [512, 1024, 3, 3]         4,719,616
│    └─ReLU: 2-26                        [2, 1024, 8, 8]           [2, 1024, 8, 8]           --                        --
│    └─BatchNorm2d: 2-27                 [2, 1024, 8, 8]           [2, 1024, 8, 8]           [1024]                    2,048
│    └─Conv2d: 2-28                      [2, 1024, 8, 8]           [2, 1024, 8, 8]           [1024, 1024, 3, 3]        9,438,208
│    └─ReLU: 2-29                        [2, 1024, 8, 8]           [2, 1024, 8, 8]           --                        --
│    └─BatchNorm2d: 2-30                 [2, 1024, 8, 8]           [2, 1024, 8, 8]           [1024]                    2,048
│    └─ConvTranspose2d: 2-31             [2, 1024, 8, 8]           [2, 512, 16, 16]          [512, 1024, 3, 3]         4,719,104
├─Sequential: 1-10                       [2, 1024, 16, 16]         [2, 256, 32, 32]          --                        --
│    └─Conv2d: 2-32                      [2, 1024, 16, 16]         [2, 512, 16, 16]          [1024, 512, 3, 3]         4,719,104
│    └─ReLU: 2-33                        [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
│    └─Dropout2d: 2-34                   [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
│    └─Conv2d: 2-35                      [2, 512, 16, 16]          [2, 512, 16, 16]          [512, 512, 3, 3]          2,359,808
│    └─ReLU: 2-36                        [2, 512, 16, 16]          [2, 512, 16, 16]          --                        --
│    └─BatchNorm2d: 2-37                 [2, 512, 16, 16]          [2, 512, 16, 16]          [512]                     1,024
│    └─ConvTranspose2d: 2-38             [2, 512, 16, 16]          [2, 256, 32, 32]          [256, 512, 3, 3]          1,179,904
├─Sequential: 1-11                       [2, 512, 32, 32]          [2, 128, 64, 64]          --                        --
│    └─Conv2d: 2-39                      [2, 512, 32, 32]          [2, 256, 32, 32]          [512, 256, 3, 3]          1,179,904
│    └─ReLU: 2-40                        [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
│    └─Dropout2d: 2-41                   [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
│    └─Conv2d: 2-42                      [2, 256, 32, 32]          [2, 256, 32, 32]          [256, 256, 3, 3]          590,080
│    └─ReLU: 2-43                        [2, 256, 32, 32]          [2, 256, 32, 32]          --                        --
│    └─BatchNorm2d: 2-44                 [2, 256, 32, 32]          [2, 256, 32, 32]          [256]                     512
│    └─ConvTranspose2d: 2-45             [2, 256, 32, 32]          [2, 128, 64, 64]          [128, 256, 3, 3]          295,040
├─Sequential: 1-12                       [2, 256, 64, 64]          [2, 64, 128, 128]         --                        --
│    └─Conv2d: 2-46                      [2, 256, 64, 64]          [2, 128, 64, 64]          [256, 128, 3, 3]          295,040
│    └─ReLU: 2-47                        [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
│    └─Dropout2d: 2-48                   [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
│    └─Conv2d: 2-49                      [2, 128, 64, 64]          [2, 128, 64, 64]          [128, 128, 3, 3]          147,584
│    └─ReLU: 2-50                        [2, 128, 64, 64]          [2, 128, 64, 64]          --                        --
│    └─BatchNorm2d: 2-51                 [2, 128, 64, 64]          [2, 128, 64, 64]          [128]                     256
│    └─ConvTranspose2d: 2-52             [2, 128, 64, 64]          [2, 64, 128, 128]         [64, 128, 3, 3]           73,792
├─Sequential: 1-13                       [2, 128, 128, 128]        [2, 1, 128, 128]          --                        --
│    └─Conv2d: 2-53                      [2, 128, 128, 128]        [2, 64, 128, 128]         [128, 64, 3, 3]           73,792
│    └─ReLU: 2-54                        [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
│    └─Dropout2d: 2-55                   [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
│    └─Conv2d: 2-56                      [2, 64, 128, 128]         [2, 64, 128, 128]         [64, 64, 3, 3]            36,928
│    └─ReLU: 2-57                        [2, 64, 128, 128]         [2, 64, 128, 128]         --                        --
│    └─BatchNorm2d: 2-58                 [2, 64, 128, 128]         [2, 64, 128, 128]         [64]                      128
│    └─Conv2d: 2-59                      [2, 64, 128, 128]         [2, 1, 128, 128]          [64, 1, 3, 3]             577
============================================================================================================================================
Total params: 34,521,793
Trainable params: 34,521,793
Non-trainable params: 0
Total mult-adds (G): 32.71
============================================================================================================================================
Input size (MB): 0.39
Forward/backward pass size (MB): 224.66
Params size (MB): 138.09
Estimated Total Size (MB): 363.14
============================================================================================================================================